brew "caskroom/cask/brew-cask"
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'codeclimate/formulae'
tap 'thoughtbot/formulae'
tap 'nviennot/tmate'

cask_args appdir: '/Applications'

brew "rcm"
brew "zsh-syntax-highlighting"
brew "thefuck"
brew "yarn"
cask "docker-toolbox"
cask "font-fira-code"
cask "iterm2"
brew "qt5"
brew "cmake"
brew "awscli"
brew "shellcheck"
brew "codeclimate"
brew "ctags"
brew "hub"
brew "openssl"
brew "neovim/neovim/neovim"
brew "nmap"
brew "nvm"
brew "pgcli"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "wget"
brew 'imagemagick'
brew 'redis', restart_service: true
cask "heroku-toolbelt"
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Applications
cask "1password"
cask "coconutbattery"
cask "grandperspective"
cask "seil"
cask "google-chrome"
cask "postico"
cask "teamviewer"
cask "transmission"
cask "tower"
cask "transmit"
cask "vlc"
cask "spectacle"
cask "dropbox"
