brew "caskroom/cask/brew-cask"
tap 'caskroom/cask'
tap 'codeclimate/formulae'
tap 'thoughtbot/formulae'
tap 'nviennot/tmate'

cask_args appdir: '/Applications'

brew "rcm"
cask "dockertoolbox"
cask "iterm2"
brew "awscli"
brew "shellcheck"
brew "codeclimate"
brew "ctags"
brew "hub"
brew "openssl"
brew "macvim"
brew "nmap"
brew "nvm"
brew "pgcli"
brew "rabbitmq"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "wget"
brew 'imagemagick'
brew 'redis', restart_service: true
cask "heroku-toolbelt"
cask "postgres"
cask 'firefox', args: { appdir: '/Applications' }
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Applications
cask "1password"
cask "alfred"
cask "atom"
cask "coconutbattery"
cask "grandperspective"
cask "flux"
cask "seil"
cask "google-chrome"
cask "linkinus"
cask "mou"
cask "postico"
cask "teamviewer"
cask "transmission"
cask "tower"
cask "transmit"
cask "vlc"
cask "spectacle"
cask "dropbox"
