tap 'codeclimate/formulae'
tap 'thoughtbot/formulae'

brew "rcm"
brew "zsh-syntax-highlighting"
brew "thefuck"
brew "yarn"
brew "docker"
# brew "font-fira-code"
brew "iterm2"
# brew "qt5"
# brew "cmake"
brew "awscli"
brew "shellcheck"
# brew "codeclimate"
# brew "ctags"
# brew "hub"
brew "openssl"
brew "neovim"
brew "nmap"
brew "nvm"
brew "pgcli"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "wget"
brew 'imagemagick'
brew 'redis', restart_service: true
brew "heroku-toolbelt"
# brew 'java' unless system '/usr/libexec/java_home --failfast'

# Applications
# brew "1password"
brew "coconutbattery"
brew "grandperspective"
brew "seil"
brew "google-chrome"
brew "postico"
brew "teamviewer"
brew "transmission"
# brew "tower"
# brew "transmit"
brew "vlc"
brew "spectacle"
# brew "dropbox"
